In [82]:
import pandas as pd
df= pd.read_csv('mummy.csv')

In [83]:
l= df.columns.tolist()

In [84]:
df_2= df[["Score", "Name"]]
df_2

      Score                Name
0   13 / 19                 NaN
1    5 / 19          Anisha sen
2   12 / 19     Darshika Dahiya
3   11 / 19       Naitik Patel
4    8 / 19  Sandhya choudhary
5   13 / 19       Aniket lodhi
6   16 / 19       Aniket lodhi
7    8 / 17     Anshika Barman
8    7 / 17        Vikas barman
9    5 / 17     Anshika Barman
10  11 / 17        Navya patel
11  13 / 17  Poornima choudhary
12  16 / 17        Aniket Lodhi
13  17 / 17        Aniket Lodhi
14   2 / 17          Mansi Sahu
15   7 / 17          Mansi Sahu
16   7 / 17          Mansi Sahu
17  10 / 17    Aashu Choudhary
18  16 / 17    Aashu Choudhary
19  17 / 17    Aashu Choudhary
20  10 / 17     DARSHIKA DAHIYA
21   7 / 17              Anish

In [85]:
df_2.dropna(inplace=True)
df_2

C:\Users\Dell\AppData\Local\Temp\ipykernel_10460\3194528941.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_2.dropna(inplace=True)

      Score                Name
1    5 / 19          Anisha sen
2   12 / 19     Darshika Dahiya
3   11 / 19       Naitik Patel
4    8 / 19  Sandhya choudhary
5   13 / 19       Aniket lodhi
6   16 / 19       Aniket lodhi
7    8 / 17     Anshika Barman
8    7 / 17        Vikas barman
9    5 / 17     Anshika Barman
10  11 / 17        Navya patel
11  13 / 17  Poornima choudhary
12  16 / 17        Aniket Lodhi
13  17 / 17        Aniket Lodhi
14   2 / 17          Mansi Sahu
15   7 / 17          Mansi Sahu
16   7 / 17          Mansi Sahu
17  10 / 17    Aashu Choudhary
18  16 / 17    Aashu Choudhary
19  17 / 17    Aashu Choudhary
20  10 / 17     DARSHIKA DAHIYA
21   7 / 17              Anish

In [93]:
k=[]
for i in df_2["Name"]:
    if i not in k:
        k.append(i)
    elif i in k:
        df_2.drop(df_2[df_2['Name'] == i].index[1], inplace=True)
df_2

      Score                Name
1    5 / 19          Anisha sen
2   12 / 19     Darshika Dahiya
3   11 / 19       Naitik Patel
4    8 / 19  Sandhya choudhary
5   13 / 19       Aniket lodhi
7    8 / 17     Anshika Barman
8    7 / 17        Vikas barman
10  11 / 17        Navya patel
11  13 / 17  Poornima choudhary
12  16 / 17        Aniket Lodhi
14   2 / 17          Mansi Sahu
17  10 / 17    Aashu Choudhary
20  10 / 17     DARSHIKA DAHIYA
21   7 / 17              Anish